app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @company = Company.all

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @company = Company.find(permitted_params[:id])

INSERT INTO "companies" ("name", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Endpoints.Ltd"], ["details", "Api"], ["created_at", "2020-06-11 23:06:05.465416"], ["updated_at", "2020-06-11 23:06:05.465416"]]
---
  def create
    @company = Company.new(permitted_params[:company])

    if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 8]]
---
  def destroy
    @company = Company.find(permitted_params[:id])
    @company.destroy