app/controllers/employees_controller.rb

  def create
    @employee = @company.employees.build(permitted_params[:employee])
    if @employee.save
---
INSERT INTO "employees" ("forename", "surname", "created_at", "updated_at", "company_id", "middlename") VALUES (?, ?, ?, ?, ?, ?)  [["forename", "Shubinder"], ["surname", "Virk"], ["created_at", "2020-06-12 15:30:35.391333"], ["updated_at", "2020-06-12 15:30:35.391333"], ["company_id", 9], ["middlename", "Sheth"]]

  def update
    if @employee.update(forename: permitted_params[:forename],
                        surname: permitted_params[:surname])
---
UPDATE "employees" SET "forename" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["forename", "Shubinderdddda"], ["updated_at", "2020-06-12 15:46:15.285677"], ["id", 14]]

  def set_employee
    @employee = Employee.find(permitted_params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def find_company
    @company = Company.find(permitted_params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]